ViniBR01/stm32-bare-metal/tests/flash/test_flash.c
/*
 * test_flash.c — Host unit tests for drivers/src/flash.c
 *
 * Tests cover:
 * - Sector address/size lookup (pure functions)
 * - Unlock/lock register manipulation
 * - Erase sector register configuration
 * - Write word/byte register configuration + data stored in fake flash
 * - Write bytes (multi-byte) + early abort on error
 * - Read word/byte from fake flash
 * - Input validation (null, alignment, out-of-range)
 * - Error flag detection
 *
 * setUp() zeros all fake peripheral structs and resets the fake flash memory
 * to 0xFF (erased state).
 */

#include "unity.h"
#include "stm32f4xx.h"
#include "flash.h"

/* ---- Test lifecycle ------------------------------------------------------- */

void setUp(void)
{
    test_periph_reset();
    flash_test_reset();
    /* Start unlocked (LOCK bit clear) for most tests */
    fake_FLASH.CR = 0;
}

void tearDown(void) {}

/* ======================================================================== */
/* Sector info (pure functions)                                               */
/* ======================================================================== */

void test_get_sector_address_sector0(void)
{
    TEST_ASSERT_EQUAL_HEX32(0x08000000U, flash_get_sector_address(0));
}

void test_get_sector_address_sector1(void)
{
    TEST_ASSERT_EQUAL_HEX32(0x08004000U, flash_get_sector_address(1));
}

void test_get_sector_address_sector2(void)
{
    TEST_ASSERT_EQUAL_HEX32(0x08008000U, flash_get_sector_address(2));
}

void test_get_sector_address_sector3(void)
{
    TEST_ASSERT_EQUAL_HEX32(0x0800C000U, flash_get_sector_address(3));
}

void test_get_sector_address_sector4(void)
{
    TEST_ASSERT_EQUAL_HEX32(0x08010000U, flash_get_sector_address(4));
}

void test_get_sector_address_sector5(void)
{
    TEST_ASSERT_EQUAL_HEX32(0x08020000U, flash_get_sector_address(5));
}

void test_get_sector_address_sector6(void)
{
    TEST_ASSERT_EQUAL_HEX32(0x08040000U, flash_get_sector_address(6));
}

void test_get_sector_address_sector7(void)
{
    TEST_ASSERT_EQUAL_HEX32(0x08060000U, flash_get_sector_address(7));
}

void test_get_sector_address_invalid_returns_zero(void)
{
    TEST_ASSERT_EQUAL_HEX32(0, flash_get_sector_address(8));
    TEST_ASSERT_EQUAL_HEX32(0, flash_get_sector_address(255));
}

void test_get_sector_size_sectors_0_to_3(void)
{
    for (uint8_t s = 0; s <= 3; s++) {
        TEST_ASSERT_EQUAL_UINT32(16U * 1024U, flash_get_sector_size(s));
    }
}

void test_get_sector_size_sector4(void)
{
    TEST_ASSERT_EQUAL_UINT32(64U * 1024U, flash_get_sector_size(4));
}

void test_get_sector_size_sectors_5_to_7(void)
{
    for (uint8_t s = 5; s <= 7; s++) {
        TEST_ASSERT_EQUAL_UINT32(128U * 1024U, flash_get_sector_size(s));
    }
}

void test_get_sector_size_invalid_returns_zero(void)
{
    TEST_ASSERT_EQUAL_UINT32(0, flash_get_sector_size(8));
}

/* ======================================================================== */
/* Address-to-sector lookup                                                  */
/* ======================================================================== */

void test_sector_for_address_each_sector_base(void)
{
    static const uint32_t bases[8] = {
        0x08000000U, 0x08004000U, 0x08008000U, 0x0800C000U,
        0x08010000U, 0x08020000U, 0x08040000U, 0x08060000U,
    };
    for (uint8_t s = 0; s < 8; s++) {
        uint8_t out = 0xFFU;
        TEST_ASSERT_EQUAL(ERR_OK, flash_sector_for_address(bases[s], &out));
        TEST_ASSERT_EQUAL_UINT8(s, out);
    }
}

void test_sector_for_address_interior_byte(void)
{
    /* A byte well inside sector 4 (slot A under the bootloader). */
    uint8_t out = 0xFFU;
    TEST_ASSERT_EQUAL(ERR_OK, flash_sector_for_address(0x08010100U, &out));
    TEST_ASSERT_EQUAL_UINT8(4U, out);

    /* Last byte of sector 7 (highest valid flash byte). */
    out = 0xFFU;
    TEST_ASSERT_EQUAL(ERR_OK, flash_sector_for_address(0x0807FFFFU, &out));
    TEST_ASSERT_EQUAL_UINT8(7U, out);
}

void test_sector_for_address_below_flash_base(void)
{
    uint8_t out = 0xFFU;
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG,
                      flash_sector_for_address(0x07FFFFFFU, &out));
}

void test_sector_for_address_beyond_flash_end(void)
{
    uint8_t out = 0xFFU;
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG,
                      flash_sector_for_address(0x08080000U, &out));
}

void test_sector_for_address_null_out(void)
{
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG,
                      flash_sector_for_address(0x08000000U, NULL));
}

/* ======================================================================== */
/* Unlock / Lock                                                              */
/* ======================================================================== */

void test_unlock_when_already_unlocked(void)
{
    fake_FLASH.CR = 0;  /* LOCK bit clear */
    TEST_ASSERT_EQUAL(ERR_OK, flash_unlock());
}

void test_unlock_writes_keys_and_succeeds(void)
{
    fake_FLASH.CR = FLASH_CR_LOCK;
    /* Simulate hardware clearing LOCK after keys are written.
     * Since fake doesn't auto-clear, we pre-clear so the second check sees unlocked. */
    fake_FLASH.CR = 0;
    TEST_ASSERT_EQUAL(ERR_OK, flash_unlock());
}

void test_unlock_fails_when_lock_persists(void)
{
    fake_FLASH.CR = FLASH_CR_LOCK;
    TEST_ASSERT_EQUAL(ERR_BUSY, flash_unlock());
}

void test_lock_sets_lock_bit(void)
{
    fake_FLASH.CR = 0;
    flash_lock();
    TEST_ASSERT_BITS_HIGH(FLASH_CR_LOCK, fake_FLASH.CR);
}

/* ======================================================================== */
/* Erase sector                                                               */
/* ======================================================================== */

void test_erase_sector_invalid_returns_error(void)
{
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_erase_sector(8));
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_erase_sector(255));
}

void test_erase_sector_sets_correct_cr_bits(void)
{
    err_t ret = flash_erase_sector(3);
    TEST_ASSERT_EQUAL(ERR_OK, ret);
    /* After completion, SER and SNB should be cleared */
    TEST_ASSERT_BITS_LOW(FLASH_CR_SER, fake_FLASH.CR);
    TEST_ASSERT_BITS_LOW(FLASH_CR_SNB, fake_FLASH.CR);
}

void test_erase_sector_0_sets_snb_0(void)
{
    flash_erase_sector(0);
    /* SNB is cleared after the operation completes, so test is limited.
     * Instead verify no error returned. */
    TEST_ASSERT_BITS_LOW(FLASH_CR_SNB, fake_FLASH.CR);
}

void test_erase_returns_error_on_hw_error_flag(void)
{
    /* Pre-set PGSERR to simulate hardware error after STRT */
    fake_FLASH.SR = FLASH_SR_PGSERR;
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_erase_sector(1));
}

/* ======================================================================== */
/* Write word                                                                 */
/* ======================================================================== */

void test_write_word_misaligned_address(void)
{
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_write_word(0x08000001U, 0));
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_write_word(0x08000002U, 0));
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_write_word(0x08000003U, 0));
}

void test_write_word_below_flash_base(void)
{
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_write_word(0x07FFFFFCU, 0));
}

void test_write_word_beyond_flash_end(void)
{
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_write_word(0x08080000U, 0));
}

void test_write_word_sets_pg_and_psize_word(void)
{
    flash_write_word(0x08000000U, 0xCAFEBABEU);
    /* After write, PG bit is cleared */
    TEST_ASSERT_BITS_LOW(FLASH_CR_PG, fake_FLASH.CR);
}

void test_write_word_stores_data(void)
{
    flash_write_word(0x08000000U, 0xDEADBEEFU);
    uint32_t val;
    flash_read_word(0x08000000U, &val);
    TEST_ASSERT_EQUAL_HEX32(0xDEADBEEFU, val);
}

void test_write_word_at_offset(void)
{
    flash_write_word(0x08000100U, 0x12345678U);
    uint32_t val;
    flash_read_word(0x08000100U, &val);
    TEST_ASSERT_EQUAL_HEX32(0x12345678U, val);
}

void test_write_word_error_flag_returns_error(void)
{
    fake_FLASH.SR = FLASH_SR_WRPERR;
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_write_word(0x08000000U, 0));
}

/* ======================================================================== */
/* Write byte                                                                 */
/* ======================================================================== */

void test_write_byte_below_flash_base(void)
{
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_write_byte(0x07FFFFFFU, 0));
}

void test_write_byte_beyond_flash_end(void)
{
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_write_byte(0x08080000U, 0));
}

void test_write_byte_stores_data(void)
{
    flash_write_byte(0x08000000U, 0xAB);
    uint8_t buf;
    flash_read_bytes(0x08000000U, &buf, 1);
    TEST_ASSERT_EQUAL_HEX8(0xAB, buf);
}

void test_write_byte_sets_pg_and_psize_byte(void)
{
    flash_write_byte(0x08000000U, 0x55);
    TEST_ASSERT_BITS_LOW(FLASH_CR_PG, fake_FLASH.CR);
}

/* ======================================================================== */
/* Write bytes (multi-byte)                                                   */
/* ======================================================================== */

void test_write_bytes_null_data(void)
{
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_write_bytes(0x08000000U, NULL, 4));
}

void test_write_bytes_zero_len(void)
{
    uint8_t buf[1] = {0};
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_write_bytes(0x08000000U, buf, 0));
}

void test_write_bytes_beyond_flash_end(void)
{
    uint8_t buf[4] = {0};
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_write_bytes(0x0807FFFFU, buf, 4));
}

void test_write_bytes_stores_multiple(void)
{
    uint8_t src[] = {0x11, 0x22, 0x33, 0x44};
    err_t ret = flash_write_bytes(0x08000010U, src, 4);
    TEST_ASSERT_EQUAL(ERR_OK, ret);

    uint8_t dst[4];
    flash_read_bytes(0x08000010U, dst, 4);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(src, dst, 4);
}

void test_write_bytes_aborts_on_error(void)
{
    /* Write first byte, then inject error before second */
    uint8_t src[] = {0xAA, 0xBB};
    /* PGPERR will be seen after the first byte's wait_bsy+check */
    fake_FLASH.SR = FLASH_SR_PGPERR;
    err_t ret = flash_write_bytes(0x08000000U, src, 2);
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, ret);
    TEST_ASSERT_BITS_LOW(FLASH_CR_PG, fake_FLASH.CR);
}

/* ======================================================================== */
/* Read word                                                                  */
/* ======================================================================== */

void test_read_word_null_out(void)
{
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_read_word(0x08000000U, NULL));
}

void test_read_word_misaligned(void)
{
    uint32_t val;
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_read_word(0x08000001U, &val));
}

void test_read_word_below_flash_base(void)
{
    uint32_t val;
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_read_word(0x07FFFFFCU, &val));
}

void test_read_word_beyond_flash_end(void)
{
    uint32_t val;
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_read_word(0x08080000U, &val));
}

void test_read_word_erased_returns_0xFFFFFFFF(void)
{
    uint32_t val;
    err_t ret = flash_read_word(0x08000000U, &val);
    TEST_ASSERT_EQUAL(ERR_OK, ret);
    TEST_ASSERT_EQUAL_HEX32(0xFFFFFFFFU, val);
}

/* ======================================================================== */
/* Read bytes                                                                 */
/* ======================================================================== */

void test_read_bytes_null_buf(void)
{
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_read_bytes(0x08000000U, NULL, 4));
}

void test_read_bytes_zero_len(void)
{
    uint8_t buf[1];
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_read_bytes(0x08000000U, buf, 0));
}

void test_read_bytes_beyond_flash_end(void)
{
    uint8_t buf[4];
    TEST_ASSERT_EQUAL(ERR_INVALID_ARG, flash_read_bytes(0x0807FFFFU, buf, 4));
}

void test_read_bytes_returns_erased_state(void)
{
    uint8_t buf[4];
    err_t ret = flash_read_bytes(0x08000000U, buf, 4);
    TEST_ASSERT_EQUAL(ERR_OK, ret);
    for (int i = 0; i < 4; i++) {
        TEST_ASSERT_EQUAL_HEX8(0xFF, buf[i]);
    }
}

void test_read_bytes_after_write(void)
{
    flash_write_word(0x08000000U, 0x04030201U);
    uint8_t buf[4];
    flash_read_bytes(0x08000000U, buf, 4);
    TEST_ASSERT_EQUAL_HEX8(0x01, buf[0]);
    TEST_ASSERT_EQUAL_HEX8(0x02, buf[1]);
    TEST_ASSERT_EQUAL_HEX8(0x03, buf[2]);
    TEST_ASSERT_EQUAL_HEX8(0x04, buf[3]);
}

/* ======================================================================== */
/* main                                                                       */
/* ======================================================================== */

int main(void)
{
    UNITY_BEGIN();

    /* Sector info */
    RUN_TEST(test_get_sector_address_sector0);
    RUN_TEST(test_get_sector_address_sector1);
    RUN_TEST(test_get_sector_address_sector2);
    RUN_TEST(test_get_sector_address_sector3);
    RUN_TEST(test_get_sector_address_sector4);
    RUN_TEST(test_get_sector_address_sector5);
    RUN_TEST(test_get_sector_address_sector6);
    RUN_TEST(test_get_sector_address_sector7);
    RUN_TEST(test_get_sector_address_invalid_returns_zero);
    RUN_TEST(test_get_sector_size_sectors_0_to_3);
    RUN_TEST(test_get_sector_size_sector4);
    RUN_TEST(test_get_sector_size_sectors_5_to_7);
    RUN_TEST(test_get_sector_size_invalid_returns_zero);

    /* Address-to-sector lookup */
    RUN_TEST(test_sector_for_address_each_sector_base);
    RUN_TEST(test_sector_for_address_interior_byte);
    RUN_TEST(test_sector_for_address_below_flash_base);
    RUN_TEST(test_sector_for_address_beyond_flash_end);
    RUN_TEST(test_sector_for_address_null_out);

    /* Unlock / Lock */
    RUN_TEST(test_unlock_when_already_unlocked);
    RUN_TEST(test_unlock_writes_keys_and_succeeds);
    RUN_TEST(test_unlock_fails_when_lock_persists);
    RUN_TEST(test_lock_sets_lock_bit);

    /* Erase */
    RUN_TEST(test_erase_sector_invalid_returns_error);
    RUN_TEST(test_erase_sector_sets_correct_cr_bits);
    RUN_TEST(test_erase_sector_0_sets_snb_0);
    RUN_TEST(test_erase_returns_error_on_hw_error_flag);

    /* Write word */
    RUN_TEST(test_write_word_misaligned_address);
    RUN_TEST(test_write_word_below_flash_base);
    RUN_TEST(test_write_word_beyond_flash_end);
    RUN_TEST(test_write_word_sets_pg_and_psize_word);
    RUN_TEST(test_write_word_stores_data);
    RUN_TEST(test_write_word_at_offset);
    RUN_TEST(test_write_word_error_flag_returns_error);

    /* Write byte */
    RUN_TEST(test_write_byte_below_flash_base);
    RUN_TEST(test_write_byte_beyond_flash_end);
    RUN_TEST(test_write_byte_stores_data);
    RUN_TEST(test_write_byte_sets_pg_and_psize_byte);

    /* Write bytes */
    RUN_TEST(test_write_bytes_null_data);
    RUN_TEST(test_write_bytes_zero_len);
    RUN_TEST(test_write_bytes_beyond_flash_end);
    RUN_TEST(test_write_bytes_stores_multiple);
    RUN_TEST(test_write_bytes_aborts_on_error);

    /* Read word */
    RUN_TEST(test_read_word_null_out);
    RUN_TEST(test_read_word_misaligned);
    RUN_TEST(test_read_word_below_flash_base);
    RUN_TEST(test_read_word_beyond_flash_end);
    RUN_TEST(test_read_word_erased_returns_0xFFFFFFFF);

    /* Read bytes */
    RUN_TEST(test_read_bytes_null_buf);
    RUN_TEST(test_read_bytes_zero_len);
    RUN_TEST(test_read_bytes_beyond_flash_end);
    RUN_TEST(test_read_bytes_returns_erased_state);
    RUN_TEST(test_read_bytes_after_write);

    return UNITY_END();
}
